{
    "status": "ok",
    "post": {
        "id": 935,
        "type": "post",
        "slug": "thank-you-adacamp",
        "url": "http://dev.local/blog/2015/06/10/thank-you-adacamp/",
        "status": "publish",
        "title": "Thank You AdaCamp",
        "title_plain": "Thank You AdaCamp",
        "content": "<p>Around this time last year I was about to have the most well deserved and heart lifting experience I have ever had in my career, <a href=\"https://adacamp.org/\" target=\"_blank\">AdaCamp</a>. At the time I felt so naive for not having found a community before that weekend. I had been living in Seattle, working as a web developer for seven years prior without a community. I went through all the motions of unease and settled into isolation as a way of life, until one day I thought about giving tech up completely. I can still remember the tweet that encouraged me to apply to attend AdaCamp. I followed the link and filled out the application, nervous that I wasn&#8217;t qualified enough to attend. I hadn&#8217;t actually contributed to open source at that time, but I used open source code at work, did that qualify me to be part of the &#8220;open technology and culture&#8221; that they were talking about, I honestly didn&#8217;t know. I have been building interactive applications since the late 90&#8217;s, but somehow inside I felt unqualified, why? AdaCamp had the answer to that question and so many others that I had only myself to ask in a vacuum. </p>\n<p>I am an awkward person socially, and usually especially with women, but I can remember my feelings of awkwardness diminishing in this environment. The other attendees were all so inspiring in who they were, what they do and how they cared for themselves and each other by being there. Talking about our experiences, and learning skills from those that were leading with intelligence and empathy I started feeling validated and my confidence level rose a thousand percent. What started as intimidating for me turned into a source of strength and inspiration in ways that I am having a hard time putting into words. I have been meaning to write this blog post for a year now! I owe this community this post, they have been there since that weekend, the support learning and growth doesn&#8217;t end after the weekend is over. I trust this community, I have asked questions on the alumni mailing list and I received thoughtful and encouraging responses. </p>\n<p>I have been reminded of our connection through favs and retweets on occasion and last month when I impetuously tweeted from the train on my morning commute that I was thinking of starting a meetup group for women and JavaScript in Seattle, the support was there. A few retweets turned into a few more favs and by the time I got to work I was dead set on doing it. I need more of that AdaCamp spirit in my life, I wanted to start something up, I know now that there are more like us out there and we can and should support one another. By using what I have learned from being part of AdaCamp I hope I can inspire, teach and build confidence in other woman that might feel like they are unqualified or who might be thinking of giving up, even though they know they love coding. <a href=\"http://www.meetup.com/Seattle-Ladies-JS/\" target=\"_blank\">Seattle Ladies JS</a> had it&#8217;s first meetup this past weekend where we setup and ran a <a href=\"http://seattleladiesjs.github.io/gulp-development-environment/\" target=\"_blank\">development environment using Gulp</a>, and it was a success. All of the ladies worked through issues together, we all learned and grew a little bit more confident together, and I know we can continue to do so. </p>\n<p>Thank you AdaCamp for making me a stronger more involved member of the tech community. I encourage every woman that has any connection to open source and technology to attend at least one AdaCamp as soon as they can.</p>\n",
        "excerpt": "<p>Around this time last year I was about to have the most well deserved and heart lifting experience I have ever had in my career, AdaCamp. At the time I felt so naive for not having found a community before that weekend. I had been living in Seattle, working as a web developer for seven [&hellip;]</p>\n",
        "date": "2015-06-10 07:38:45",
        "modified": "2015-06-10 07:38:45",
        "categories": [
            {
                "id": 63,
                "slug": "adacamp",
                "title": "AdaCamp",
                "description": "",
                "parent": 0,
                "post_count": 1
            },
            {
                "id": 11,
                "slug": "meetup",
                "title": "Meetup",
                "description": "",
                "parent": 3,
                "post_count": 3
            },
            {
                "id": 3,
                "slug": "web-development",
                "title": "Web Development",
                "description": "General category for web development topics.",
                "parent": 0,
                "post_count": 29
            }
        ],
        "tags": [],
        "author": {
            "id": 1,
            "slug": "avacollins",
            "name": "avacollins",
            "first_name": "",
            "last_name": "",
            "nickname": "avacollins",
            "url": "",
            "description": ""
        },
        "comments": [],
        "attachments": [],
        "comment_count": 0,
        "comment_status": "open",
        "custom_fields": {}
    },
    "previous_url": "http://dev.local/blog/2015/03/03/forward2-web-technology-summit/"
}