{
    "post": {
        "id": 936,
        "status": "published",
        "slug": "new-year-new-job",
        "title": "New Year, New Job",
        "content": "<p>The past year was bittersweet, I grew professionally and personally, experienced great joys and deep pains, sometimes simultaneously.I attended a bunch of great conferences (<ahref=\"http://forwardjs.com/\">Forward 2</a>, <a href=\"http://presspublish.events/\">Press Publish</a>, <ahref=\"http://opensourcebridge.org/\">Open Source Bridge</a>, <a href=\"http://www.alterconf.com/\">AlterConf</a> <a href=\"http://2015.cascadiajs.com/\">CascadiaFest</a>,<a href=\"http://osfeels.com/\">Open Source &amp; Feelings</a> ) met a ton of awesome people, I started a <ahref=\"http://www.meetup.com/Seattle-Ladies-JS/\">meetup group</a>, met more awesome people, I gave  my first technical talk at<a href=\"http://www.meetup.com/seattlejs/\">Seattle JS</a> in front of supportive awesome people and I quit my job without a another job lined up.</p><p>I had originally written a post about my decision to look for a new job, but aftera nights sleep on it I decided to redact it. I'd rather just say thatI am super excited to start my new job at <a href=\"http://www.lindenlab.com/\">Linden Lab</a>.I'm equally excited to say that the product I will be supporting is one that I have been envisioning since I was doing 3D development in college, Virtual Reality worlds, finally! In their own words,<em>\"Project Sansar is the codename of our new platform for user-created virtual experiences. Sansar will democratize VR as a creative medium and make it easy for people to create, share, and profit from social virtual experiences.\"</em>I couldn't be more invigorated and ready to start 2016, I have more drive and motivation now than ever as I look forward to coding, blogging, meetups and conferencing, I hope to see you around, IRL or online.</p>",
        "date": "January 2, 2016",
        "categories": [],
        "tags": [],
        "comments": [],
        "attachments": [],
        "comment_status": "open",
        "custom_fields": {},
        "previous_url": "thank-you-adacamp",
        "next_url": ""
    }
}
